---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayoutRule
source: html/341fa8a7-43ef-896a-8942-0968e0819499.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayoutRule Property

"Layout Rule"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemLayoutRule { get; }
```